{
    "journey": [
        "I fell in love with programming the moment my cousin Cris introduced me to JavaScript. Then, I enrolled for college with my chosen course program 'BSIT'. From there I ventured into C# and .NET development. Got immersed into object-oriented programming until a year later I have left with no choice but to just self-study since the pandemic COVID-19 affected my college career and I had to basically stop my education...",
        "Growing up I have always found the joy to solve problems, and sure enough my stopping from college did not deter me to strive even harder. Sleepless nights turned to months and before I noticed it I was already working as a junior web developer from a company based in the Philippines...",
        "For sure bootcamps (AWS re/Start Program and Kodego) did help, but really, I know it's my determination and hard work, the support of my family, and with God's help was I only able to have pulled this off. Now I'm already a year old in my company, and counting…"
    ],
    "goals": [
        "I can imagine myself focusing on just one part of web development… and that is being an expert of frontend development. You know, tools like Figma for UI designs, React and Next.js, and TypeScript for development, animations, among other things. And although I'm a full-stack developer graduate from my past bootcamp, I'd still very much prefer to be an expert in frontend development. I mean, I don't know… CSS excites me...",
        "With my love for puzzles and solving bugs, the thrill of the process of solving them and then the satisfaction that comes after it are just some of the things that I enjoy being a web developer. Plus, I also think of it as some sort of an art. Delivering what the client needs and wants in so many creative ways."
    ],
    "inspiration": [
        "Always, my inspiration is my family… my mom, my sister and my nephews, my aunties and uncles, titas and titos, cousins, and friends. For so long, I have always known how being helpless is like. And so I wanna be that person to offer help in many ways possible… be it career advice (in IT), or just from the small things like listening to them talk...",
        "You see, I grew up from a poor family background and, so, I know the harshest of things that could potentially hinder someone's confidence and talent from growing. I guess I can say all I want is for someone to take a chance on me and offer me an opportunity so that I can do it to someone else as well."
    ],
    "hobbies": [
        "I love doing a lot of things, and some of them might have been what got me into programming in the first place. So, to state a few… I'd say painting has been the closest to my heart. Like, when I see a good angle, I'll always take a good glimpse of it enough for me to be able to remember and just paint...",
        "Well, at least a few years back. Because currently, what I now enjoy most of the time is just listening to music and being inspired while coding. In third place is cooking. I love experimenting with dishes. Fourth is learning foreign languages like Spanish and Korean.",
        "I always think about one day that I'd be able to fly to other countries and work there and at the same time learn their languages. :)"
    ]
}
